<template>
  <div>
    <!-- TODO: Remove the following element once you have read the documentation. -->
    <!-- <div
      v-if="$config.development"
      :style="{
        background: '#5163ba',
        padding: '1rem',
        textAlign: 'center',
        fontSize: '0.85rem',
        color: '#fff',
      }"
    >
      <p>
        <strong>👋 Welcome to your new website!</strong> To customize the code
        and content of this site,&nbsp;<a
          href="https://github.com/prismicio-community/nuxt-starter-prismic-multi-language/tree/master/docs"
          target="_blank"
          rel="noreferrer"
          :style="{
            textDecoration: 'underline',
          }"
          >see the documentation</a
        >. Remove this bar in <code>layouts/default.vue</code>.
      </p>
    </div> -->
    <Header
      v-if="navigation.data && settings.data"
      :alternate-languages="alternateLanguages"
      :navigation="navigation"
      :settings="settings"
    />
    <!-- <MiniCart /> -->
    <main><nuxt /></main>
    <Footer v-if="settings.data" :settings="settings" />
  </div>
</template>

<script>
export default {
  head() {
    return {
      htmlAttrs: {
        lang:
          this.$i18n.locale.slice(0, -2) +
          this.$i18n.locale.slice(-2).toUpperCase(),
      },
    };
  },
  mounted() {
    console.log(`
                                         ▄▄▄▄▄▄
                                    ▄▄██████████████████▄▄
                               ▄▄███████████████████████████▌▄
                           ▄▄█████████████▀▀▀▀▀▀▀▀▀▀▀██████████▄
                        ▄▄██████████▀▀  ░    ░ ░ ░░     ▀███████▌
                      ▄█████████▀      ▄░  ▐██████████▄▄   ██████▌
                    ▄████████▀    ▄▄█████░  ██████████████▄▐██████
                  ▄███████▀    ▄█████████▌   █████████████████████░
                 ███████▀   ▄█████████████▄  ▐████████████████████
                ███████   ░████████████████░  ▐███████████████████
               ██████▀   ▄██████████████████░  ▐██████████████████▄
              ██████▌   █████████████████████▄   ██████████████████
             ▐██████   ███████████████████████▄   ██████████████████▄
             ▓█████▌  ▐████████████████████████▌   ▀█████████████████▄
             ▓█████▌  ███████████████████████████   ▐█████████████████▌
             ▐██████░ ▀███████████████████████████▄▄▄███████████████████
              ▀██████▄░████████████████████████████████▀▀▀▀▀▀▀▀▀▀████████▄
               ▀██████████████████████████████████▀▀ ░  ░ ░▄▄▄▄▄▄  ▀██████░
                 ▀████████████████████████████▀▀    ▄▄▓████████████████████
                    ▀▀█████████████████████▀▀  ░ ▄████████████████▀████████
                        ▀████████████████▀    ▄██████████████████░  ██████▌
                          ▐█████████████▀   ▄██████████████████▀   ███████
                            ▀██████████   ▐██████████████████▀   ▄███████
                             ▐████████▌  ░████████████████▀    ▄███████▀
                               ███████▌   ▀███████████▀▀    ▄█████████
                                ▀██████▄    ▐▀▀▀▀▀      ▄▄█████████▀
                                 ▀███████▄▄▄░░ ░  ▄▄▄████████████▀
                                   ██████████████████████████▀▀
                                     ▀███████████████████▀▀
                                         ▀▀▀▀▀▀▀▀▀▀▀▀
    `);
  },

  computed: {
    alternateLanguages() {
      return this.$store.state.prismic.alternateLanguages;
    },
    navigation() {
      return this.$store.state.prismic.navigation;
    },
    settings() {
      return this.$store.state.prismic.settings;
    },
  },
};
</script>

<style>
body {
  @apply overflow-x-hidden antialiased;
}

.page-enter-active,
.page-leave-active {
  transition: all 0.5s;
}

.page-enter,
.page-leave-to {
  opacity: 0;
}
</style>
